"""Серед значень трьох функцій в заданій точці х обрати мінімальне і максимальне значення

Перша функція: y = x * x
Друга функція: y = x * 2
Третя функція: y = (x / 2) + x

Питання задачі
Написати формули для розрахунку значень заданих функцій в довільній точці х.
Знайти серед цих значень максимальне і мінімальне значення. Повернути знайдені значення."""

def solution(x):
    results = (x * x, x * 2, (x / 2) + x)
    min_v = results[0]
    max_v = results[0]
    for n in results:
        if n < min_v:
            min_v = n
        if n > max_v:
            max_v = n
    return min_v, max_v