"""Порівняння словників зі студентськими оцінками
Ваше завдання - написати функцію, яка порівнює два словника, представляючи оцінки студентів за курси.
Кожен словник має структуру {'ПІБ студента': оцінка}.
Функція повинна порівнювати оцінки студентів за кожний предмет та
повертати словник з різницею в оцінках для кожного студента.
"""


def solution(grades1, grades2):
    x = dict()
    for name, grade in grades1.items():
        if name in grades2:
            x.update({name: (grade -grades2[name])})
    return x