"""Ви тестуєте програму, яка працює з конфігураційними файлами,
і вам потрібно здійснити тестування різних варіантів конфігурацій.
Задача:
1. Доробіть функцію change_params(старе_значення, нове_значення),
яка приймає на вхід старе значення параметра та нове значення, яке треба вставити.
2. Функція повинна замінити всі входження старого значення на нове і повернути замінені дані."""


def change_params(old_value:str, new_value:str):
    filetext = """\
    screen_size = 800x600
    paralel_processes = 10
    db_conection = localhost:5432"""




    return filetext