"""Написати програму, яка розраховує оподаткування на основі річного доходу користувача.
Отримайте річний дохід користувача.
Ми припускаємо, що користувач ЗАВЖДИ буде вводити нормальне число (≥0)
На основі введеного доходу розрахуйте податок за такими умовами:
- Якщо дохід менше 10 000 грн, податок складає 10% від доходу.
- Якщо дохід від 10 000 до 50 000 грн, податок складає 15% від доходу.
- Якщо дохід більше 50 000 грн, податок складає 20% від доходу.
Запишіть результат у змінну tax_amount."""


def calculate_tax(user_income):
    tax_amount = 0
    if user_income < 10_000:
        tax_amount = user_income * 0.1
    elif user_income < 50_000:
        tax_amount = user_income * 0.15
    else:
        tax_amount = user_income * 0.2
    return tax_amount