"""Ваша задача - написати функцію, яка визначає, чи є введене користувачем число простим чи складеним.
Зазначте, що користувач завжди буде вводити цілі числа.
Простим вважаємо число, яке має 2 дільники - одиницю і саме це число
Ваш код повинен використовувати цикл та умови для визначення простоти числа.
Запишіть результат в змінну result."""


def is_prime_number(number):
    result = True
    for i in range(2, number-1):
        if number % i == 0:
            result = False
            break
    return result